{
  "title": "Indiana Jones Scholarship",
  "fundingType": "Fully funded",
  "educationalLevel": ["S2"],
  "country": ["United States", "Canada"],
  "registrationDate": "2023-11-15",
  "deadlineDate": "2023-01-31",
  "description": "This scholarship program is offered by the Government of Ireland for international students who wish to pursue a Master's degree in Ireland. The scholarship covers tuition fees, living expenses, and research costs.",
  "university": ["All universities in Ireland registered on the official scholarship website"],
  "programs": ["Medicine", "Dentistry, and other health sciences"],
  "requirements": [
    "Non-UE/EEA citizens who have completed a Bachelor's degree at a recognized university.",
    "Desire to pursue a Master's degree in Ireland for the academic year 2024/2025.",
    "Strong academic record and a clear research plan.",
    "Proficiency in the English language at the standard of the target university.",
    "Not currently receiving a full or partial scholarship."
  ],
  "benefits": [
    "Full tuition fees up to a maximum of €16,000 per year.",
    "Living expenses of €1,200 per month.",
    "Research costs of €3,250 per year.",
    "Maximum scholarship duration of 2 years for Master's programs."
  ],
  "applicationProcess": [
    "Identify and contact potential supervisors at the destination university in Ireland. Supervisors should be willing to support the scholarship application and provide letters of recommendation.",
    "Complete the online application form on the official scholarship website. The application form should be accompanied by supporting documents, including transcripts, letters of recommendation, a research plan, English language certificates, and more.",
    "Submit the application before the specified deadline, which is October 21, 2023, at 4:00 PM Irish time.",
    "Participate in the selection process, which includes academic evaluation, assessment of the research plan, and interviews if required.",
    "Wait for the announcement of the selection results in March 2024."
  ],
  "sourceInformation": "http://scholarshipwebsite.com/full-scholarship"
}
